In [4]:
import pandas as pd
import numpy as np

data = {
    'emp_id': [1, 2, 3, 4, 5, 6],
    'name': ['Aman', 'Riya', 'Kunal', 'Neha', 'Amit', 'Pooja'],
    'dept': ['IT', 'HR', 'IT', 'HR', 'Finance', 'IT'],
    'salary': [60000, 50000, np.nan, 45000, 70000, np.nan],
    'experience': [3, 2, 4, 1, 6, 5]
}

df = pd.DataFrame(data)
df

   emp_id   name     dept   salary  experience
0       1   Aman       IT  60000.0           3
1       2   Riya       HR  50000.0           2
2       3  Kunal       IT      NaN           4
3       4   Neha       HR  45000.0           1
4       5   Amit  Finance  70000.0           6
5       6  Pooja       IT      NaN           5

In [6]:
df.isnull().sum()

emp_id        0
name          0
dept          0
salary        2
experience    0
dtype: int64

In [9]:
df["salary"].fillna(df["salary"].mean(),inplace=True)
df

   emp_id   name     dept   salary  experience
0       1   Aman       IT  60000.0           3
1       2   Riya       HR  50000.0           2
2       3  Kunal       IT  56250.0           4
3       4   Neha       HR  45000.0           1
4       5   Amit  Finance  70000.0           6
5       6  Pooja       IT  56250.0           5

In [19]:
df.groupby("dept")["salary"].mean()

dept
Finance    70000.0
HR         47500.0
IT         57500.0
Name: salary, dtype: float64

In [24]:
df.groupby("dept").agg({
    "salary":"mean",
    "experience":"max"})

          salary  experience
dept
Finance  70000.0           6
HR       47500.0           2
IT       57500.0           5

In [26]:
df.groupby("dept")["emp_id"].count()

dept
Finance    1
HR         2
IT         3
Name: emp_id, dtype: int64